import random

"""
# random.seed(10) # 未加 seed  的时候
for i in range(5):
    print(random.random()) # 每次输出结果都不一样


0.08177707852190708
0.7420983175700955
0.7847710751931118
0.5298277841695523
0.2906300754296308 
    
    
"""



# random.seed(10) # 在外层时无效
for i in range(5):
    random.seed(10)
    print(random.random()) # 每次输出结果都不一样

"""
0.5714025946899135
0.5714025946899135
0.5714025946899135
0.5714025946899135
0.5714025946899135
"""

"""
seed 的作用:
    在未加 seed 之前.每次的随机值不稳定
    相同的 seed 值下. 必然可以获得一致的 随机值
"""
