"""

项目开发流程

    需求分析    确定用户真实需求
        确定用户真实需求, 项目基本功能
        确定整体难度以及可行性
        完成需求分析文档, 进行确认

    概要设计    对项目进行整体设计, 技术架构确定
        确定整体架构和功能模块
        确定技术思路和使用大的技术方向
        完成项目规划和分工
        形成概要设计文档

    详细设计和编码     代码编写和代码设计文档
        编写项目代码
        代码基本测试
        技术攻关
        完成详细设计文档

项目注意事项
    文档编写
        需求分许文档
        概要设计文档
        详细设计文档
        测试文档
        说明文档

    项目冲突
        按时完成项目是项目经理的首要工作

    项目工具使用推荐
        文档编写    word markdown ppt excel
        流程图     visio mindmanger xmind
        项目管理    project
        代码管理    git svn


"""

"""
pip 的使用


"""





